var arr=["阿勒泰","安康","阿克苏","安庆","包头","北海","北京","保山","广州","常德","郑州","长春","朝阳","酒泉","赤峰","长治","重庆","长海","长沙","成都","常州","大同","达县","丹东","大连","敦煌","大庸","恩施",
"延安","福州","阜阳","富蕴","广汉","格尔木","海口","黑河","呼和浩特","合肥","杭州","黄花机场(长沙)","海拉尔",
"乌兰浩特","哈密","衡阳","哈尔滨","和田","汉中","银川","且末","庆阳","景德镇","嘉峪关","九江","晋江","佳木斯",
"库车","喀什","南昌","昆明","吉安","赣州","库尔勒","克拉玛依","贵阳","桂林","兰州","梁平","庐山","拉萨","林西",
"洛阳","连云港","临沂","兰州东","柳州","牡丹江","梅县","南充","齐齐哈尔","宁波","南京","南宁","南阳","首都机场(北京)",
"上海浦东","上海","沈阳","山海关","沙市","西安","汕头","思茅","三亚","深圳","青岛","铜仁","辽通","济南","天津",
"屯溪","太原","乌鲁木齐","榆林","武汉","万县","兴城","襄樊","西昌","锡林浩特","兴宁","咸阳机场(西安)","厦门","西宁",
"徐州","宜昌","伊宁","依兰","延吉","烟台","昭通","中川机场(兰州)","湛江","珠海"
]

var list=["AAT","AKA","AKU","AQC","BAV","BHY","BJS","BSD","CAN","CGD","CGO","CGQ","CHG",
"CHW","CIF","CIH","CKG","CNI","CSX","CTU","CZX","DAT","DAX","DDG","DLC","DNH","DYG","ENH",
"ENY","FOC","FUG","FYN","GHN","GOQ","HAK","HEK","HET","HFE","HGH","HHA","HLD",
"HLH","HMI","HNY","HRB","HTN","HZG","INC","IQM","IQN","JDZ","JGN","JIU","JJN","JMU",
"KCA","KHG","KHN","KMG","KNC","KOW","KRL","KRY","KWE","KWL","LHW","LIA","LUZ","LXA","LXI",
"LYA","LYG","LYI","LZD","LZH","MOG","MXZ","NAO","NDG","NGB","NKG","NNG","NNY","PEK",
"PVG","SHA","SHE","SHP","SHS","SIA","SWA","SYM","SYX","SZX","TAO","TEN","TGO","TNA","TSN",
"TXN","TYN","URC","UYN","WUH","WXN","XEN","XFN","XIC","XIL","XIN","XIY","XMN","XNN",
"XUZ","YIH","YIN","YLN","YNJ","YNT","ZAT","ZGC","ZHA","ZUH"
]